Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: By default, pressing Esc has no effect.
ja: デフォルトでは、Escを押しても何の効果もありません。

source: By default, relative paths are relative to the directory of the file which contains the #Include directive.
ja: デフォルトでは、相対パスは#Includeディレクティブを含むファイルのディレクトリからの相対パスとなります。

source: By default, the GUI closes after creating a file unless the Ctrl key is held down.
ja: デフォルトでは、ファイルを作成した後、Ctrlキーを押し続けない限り、GUIは閉じます。

source: By default, the URL is retrieved directly from the remote server (that is, never from Internet Explorer's cache).
ja: デフォルトでは、URLはリモートサーバーから直接取得されます（つまり、Internet Explorerのキャッシュから取得することはありません）。

source: By default, the class's Prototype contains all instance methods and dynamic properties defined within the class definition, and can be used to retrieve references to methods or property getters/setters or define new ones.
ja: デフォルトでは、クラスのプロトタイプは、クラス定義内で定義されたすべてのインスタンスメソッドとダイナミックプロパティを含み、メソッドやプロパティのゲッター/セッターへの参照を取得したり、新しいものを定義したりするために使用できます。

source: By default, the control panel only lists devices that are enabled and plugged in (if applicable), but this can be changed via the right-click menu.
ja: デフォルトでは、コントロールパネルは有効でプラグインされているデバイス（該当する場合）のみをリストアップしますが、これは右クリックメニューで変更できます。

source: By default, the hard carriage return (Enter) between the previous line and this one is also preserved.
ja: デフォルトでは、前の行とこの行の間のハードキャリッジリターン（Enter）も保持されます。

source: By default, the hard carriage return (Enter) between the previous line and this one will be written to the file.
ja: デフォルトでは、前の行とこの行の間のハードキャリッジリターン（Enter）がファイルに書き込まれます。

source: By default, the height of items must be an even value.
ja: デフォルトでは、アイテムの高さは偶数でなければならない。

source: By default, the hotkey will only activate when you release Numpad0, and only if you didn't press Numpad0 and Numpad1 in combination.
ja: デフォルトでは、Numpad0を離したときに、Numpad0とNumpad1を組み合わせて押さなかった場合にのみ、ホットキーが有効になります。

source: By default, the indentation (tab) to the left of this line is preserved.
ja: デフォルトでは、この行の左側のインデント（タブ）が保持されます。

source: By default, the maximum range is 366 days, which can be changed by sending the MCM_SETMAXSELCOUNT message to the control.
ja: デフォルトでは、最大範囲は366日で、MCM_SETMAXSELCOUNTメッセージをコントロールに送信することで変更できる。

source: By default, the script can also be paused via its tray icon or main window.
ja: デフォルトでは、トレイアイコンまたはメインウィンドウからスクリプトを一時停止することも可能です。

source: By default, the script can also be reloaded via its tray icon or main window.
ja: デフォルトでは、スクリプトはトレイアイコンまたはメインウィンドウから再読み込みすることも可能です。

source: By default, the script can also be suspended via its tray icon or main window.
ja: デフォルトでは、スクリプトはトレイアイコンまたはメインウィンドウから中断することもできる。

source: By default, the system redirects certain registry keys to prevent conflicts.
ja: デフォルトでは、競合を防ぐために特定のレジストリキーをリダイレクトするようになっています。

source: By default, the table is sorted by font names in ascending order.
ja: デフォルトでは、テーブルはフォント名の昇順でソートされます。

source: By default, the window is automatically hidden after the callback returns, or if no callbacks were registered.
ja: デフォルトでは、コールバックが戻った後、またはコールバックが登録されていない場合、ウィンドウは自動的に非表示になります。

source: By default, the window's background color is the system's color for the face of buttons.
ja: デフォルトでは、ウィンドウの背景色は、ボタンの表面のシステムの色になります。

source: By default, this makes the window visible, unminimizes it (if necessary) and activates it.
ja: デフォルトでは、ウィンドウを可視化し、（必要に応じて）最小化を解除し、アクティブ化します。

source: By default, this margin is proportional to the size of the currently selected font (0.75 times font-height for top & bottom).
ja: デフォルトでは、このマージンは現在選択されているフォントのサイズに比例します（上部と下部はフォントハイトの0.75倍）。

source: By default, this margin is proportional to the size of the currently selected font (1.25 times font-height for left & right).
ja: デフォルトでは、このマージンは現在選択されているフォントのサイズに比例します（左と右はfont-heightの1.25倍）。

source: By default, values are right-aligned and spaces are used for padding.
ja: デフォルトでは、値は右寄せになり、パディングにはスペースが使用されます。

source: By default, when multiple functions are registered for a single MsgNumber, they are called in the order that they were registered.
ja: デフォルトでは、1つのMsgNumberに対して複数の関数が登録されている場合、登録された順番に呼び出されます。

source: By enclosing the two statements MsgBox "test1" and Sleep 5 with braces, the If statement knows that it should execute both if x is equal to 1.
ja: MsgBox "test1"とSleep 5の2つの文を中括弧で囲むことで、If文は、xが1に等しい場合に両方を実行すべきことを知ることができます。

source: By means of the Hotkey function, hotkeys can be created dynamically while the script is running.
ja: Hotkey機能により、スクリプトの実行中に動的にホットキーを作成することができます。

source: By pressing Win+H (or another hotkey of your choice), the currently selected text can be turned into a hotstring.
ja: Win+H（または任意の他のホットキー）を押すことで、現在選択されているテキストをホットストリングに変換することができます。

source: By specifying -Theme, all subsequently created controls in the window will have the Classic Theme appearance.
ja: Themeを指定すると、その後に作成されるウィンドウ内のコントロールはすべてクラシックテーマの外観となります。

source: By storing A_TickCount in a variable, elapsed time can later be measured by subtracting that variable from the latest A_TickCount value.
ja: A_TickCountを変数に格納することで、最新のA_TickCountの値からその変数を引くことで、後で経過時間を計測することができる。

source: ByRef Parameters
ja: ByRefパラメータ

source: ByRef parameters
ja: ByRefパラメータ

source: ByRef parameters are now able to receive a reference to a local variable from a previous instance of the same function, when it is called recursively.
ja: ByRefパラメータは、同じ関数が再帰的に呼び出されたときに、前のインスタンスからローカル変数への参照を受け取ることができるようになりました。

source: ByRef parameters no longer implicitly take a reference to the caller's variable.
ja: ByRefパラメータが暗黙のうちに呼び出し元の変数への参照を取ることはなくなりました。

source: C = Creation time
ja: C＝作成時間

source: CLSID List (Windows Class Identifiers) | AutoHotkey v2
ja: CLSIDリスト（Windowsクラス識別子）｜AutoHotkey v2

source: CLSID List (Windows Class Identifiers)
ja: CLSIDリスト（Windowsクラス識別子）

source: CLSID or human-readable Prog ID of the COM object to create.
ja: 作成する COM オブジェクトの CLSID または人間が読める Prog ID。

source: CLSID or human-readable Prog ID of the COM object to retrieve.
ja: 取得する COM オブジェクトの CLSID または人間が読み取れる Prog ID。

source: COM Calls
ja: COM呼び出し

source: COM Objects
ja: COMオブジェクト

source: COM Objects (ComObject)
ja: COMオブジェクト(ComObject)

source: COM errors now exit the thread when choosing not to continue (vs. exiting the entire script).
ja: COMエラーが発生した場合、続行しないことを選択するとスレッドが終了するようになりました（スクリプト全体が終了するのではありません）。

source: COM objects no longer set A_LastError when a property or method invocation fails.
ja: COMオブジェクトが、プロパティやメソッドの呼び出しに失敗したときに、A_LastErrorを設定しなくなりました。

source: COM objects which are accessible to VBScript and similar languages are typically also accessible to AutoHotkey via ComObject, ComObjGet or ComObjActive and the built-in object syntax.
ja: VBScriptや同様の言語でアクセス可能なCOMオブジェクトは、通常、ComObject、ComObjGet、ComObjActiveおよび組み込みオブジェクト構文によってAutoHotkeyでもアクセスできます。

source: COM objects which don't support IDispatch can be used with DllCall by retrieving the address of a function from the virtual function table of the object's interface.
ja: IDispatchをサポートしていないCOMオブジェクトは、オブジェクトのインターフェースの仮想関数テーブルから関数のアドレスを取得することで、DllCallで使用できます。

source: COM uses the following values to identify basic data types:
ja: COMは、基本的なデータ型を識別するために、以下の値を使用します：

source: COM wrapper objects now identify as instances of a few different classes depending on their variant type (which affects what methods and properties they support, as before):
ja: COMラッパーオブジェクトは、バリアントタイプによっていくつかの異なるクラスのインスタンスとして識別されるようになりました（以前のように、どのメソッドとプロパティをサポートするかに影響します）：

source: COM wrapper objects with variant type VT_BYREF, VT_ARRAY or VT_UNKNOWN now have a Ptr property equivalent to ComObjValue(ComObj).
ja: VT_BYREF、VT_ARRAY、VT_UNKNOWNのバリアントタイプを持つCOMラッパーオブジェクトに、ComObjValue(ComObj)と同等のPtrプロパティが付くようになりました。

source: COM wrapper objects with variant type VT_DISPATCH or VT_UNKNOWN and a null interface pointer now have a Ptr property which can be read or assigned.
ja: VT_DISPATCHまたはVT_UNKNOWNというバリアントタイプとNULLインターフェイスポインターを持つCOMラッパーオブジェクトが、読み取りまたは割り当て可能なPtrプロパティを持つようになりました。

source: CP0 does not universally identify a single code page; rather, it corresponds to the system default ANSI code page, which depends on the system locale or "language for non-Unicode programs" system setting.
ja: CP0は、普遍的に1つのコードページを識別するのではなく、システムのデフォルトのANSIコードページに対応し、システムロケールまたは「非Unicodeプログラム用の言語」のシステム設定に依存します。

source: CREATE_ALWAYS := 2 ; Create new file (overwriting any existing file).
ja: CREATE_ALWAYS := 2 ; 新規ファイルを作成します（既存のファイルを上書きします）。

source: Caching
ja: キャッシング

source: Calculates the date 31 days from now and reports the result in human-readable form.
ja: 今から31日後を人間が判別できる形式で表示します。

source: Calculates the date 31 days from now.
ja: 31日後の日付を計算します。

source: Calculates the number of days between two timestamps and reports the result.
ja: 2つのタイムスタンプの間の日数を計算し、結果を報告します。

source: Calculates the size of a folder, including the files in all its subfolders.
ja: フォルダーのサイズを、そのすべてのサブフォルダー内のファイルを含めて計算します。

source: Call ComObjConnect(yourObject) to disconnect the object (stop handling events).
ja: ComObjConnect(yourObject)を呼び出し、オブジェクトの接続を解除する（イベントの処理を停止する）。

source: Call ComObjConnect(yourObject, "Prefix") to enable event-handling.
ja: ComObjConnect(yourObject, "Prefix")を呼び出し、イベントハンドリングを有効にします。

source: Call MyStruct := Buffer(123, 0) to allocate a buffer to hold the structure's data.
ja: MyStruct := Buffer(123, 0)を呼び出して、構造体のデータを保持するバッファを確保します。

source: Call AutoHotkey.exe on the command line and pass the script's filename as a command-line parameter.
ja: コマンドラインでAutoHotkey.exeを呼び出し、スクリプトのファイル名をコマンドラインパラメータとして渡します。

source: Call a function
ja: 関数を呼び出す

source: Call a property/method literally named Method:
ja: 文字通りMethodという名前のプロパティ/メソッドを呼び出す：

source: Call a property/method where the name is determined by evaluating an expression or variable:
ja: 式または変数の評価によって名前が決定されるプロパティ/メソッドを呼び出す：

source: Call can be overridden within a class definition by defining a static method, such as static Call().
ja: Call は、static Call() のような静的メソッドを定義することにより、クラス定義内でオーバーライドすることができます。

source: Call the new object's __Init method, if it has one.
ja: 新しいオブジェクトに __Init メソッドがある場合は、それを呼び出します。

source: Call the new object's __New method, if it has one.
ja: 新しいオブジェクトに __New メソッドがある場合は、それを呼び出します。

source: Call the target function, passing MyStruct as a Ptr argument.
ja: MyStructをPtr引数として、ターゲット関数を呼び出す。

source: Call this function with a source pattern like "A:\Scripts\*.ahk" and an existing destination directory like "B:\Script Backup".
ja: この関数は、「A:\Scripts\*.ahk」のようなソースパターンと「B:\Script Backup」のような既存の保存先ディレクトリを指定して呼び出します。

source: Callback Parameters
ja: コールバックパラメータ

source: Callback Return Value
ja: コールバックの戻り値

source: CallbackCreate - Syntax & Usage | AutoHotkey v2
ja: CallbackCreate - 構文と使用法｜AutoHotkey v2

source: CallbackCreate returns a machine-code address.
ja: CallbackCreate は、マシンコード・アドレスを返す。

source: Calling OSError(code) with a numeric code sets Number and Message based on the given OS-defined error code.
ja: OSError(code)を数値コードで呼び出すと、与えられた OS 定義のエラーコードに基づきNumberとMessageが設定されます。

source: Calling ComObjValue is equivalent to variant.llVal, where ComObj is treated as a VARIANT structure.
ja: ComObjValueの呼び出しはvariant.llValと同等であり、ComObjは VARIANT構造として扱われます。

source: Calling TrayTip multiple times will usually cause multiple notifications to be placed in a "queue" instead of each notification replacing the last.
ja: TrayTipを複数回呼び出すと、通常、各通知が最後の通知を置き換えるのではなく、複数の通知が「キュー」に入れられます。

source: Calling the object itself only invokes the Call method.
ja: オブジェクト自体を呼び出すと、Callメソッドが呼び出されるだけである。

source: Callouts specified via a pcre_callout variable can be any callable object, or pcre_callout itself can be directly defined as a function (perhaps a nested function).
ja: pcre_callout変数を介して指定されたコールアウトは、任意の呼び出し可能なオブジェクトであることができ、またはpcre_callout自体は、関数（おそらく入れ子関数）として直接定義することができます。

source: Calls a function inside a DLL, such as a standard Windows API function.
ja: Windows標準のAPI関数など、DLL内部の関数を呼び出します。

source: Calls a native COM interface method by index.
ja: COMのネイティブインターフェースメソッドをインデックスで呼び出します。

source: Calls the API function "IsWindowVisible" to find out if a Notepad window is visible.
ja: API関数「IsWindowVisible」を呼び出し、メモ帳ウィンドウが表示されているかどうかを調べる。

source: Calls the API's wsprintf() to pad the number 432 with leading zeros to make it 10 characters wide (0000000432).
ja: APIのwsprintf()を呼び出し、数字432に先頭のゼロをパッドして10文字幅(0000000432)にします。

source: Calls the Win32 SetLastError() function.
ja: Win32 SetLastError()関数を呼び出します。

source: Calls the Windows API function "MessageBox" and reports which button the user presses.
ja: Windows API関数「MessageBox」を呼び出し、ユーザーがどのボタンを押したかを報告します。

source: Calls the Windows API function "SetSuspendState" to have the system suspend or hibernate.
ja: Windows API関数「SetSuspendState」を呼び出し、システムをサスペンドまたは休止状態にします。

source: Calls the function.
ja: 関数を呼び出します。

source: Calls to AutoHotkey objects via the IDispatch interface now transparently support VT_BYREF parameters.
ja: IDispatchインターフェースを介したAutoHotkeyオブジェクトの呼び出しが、VT_BYREFパラメータを透過的にサポートするようになりました。

source: Calltips may show you what the parameters are for a function while you are writing code to call the function.
ja: Calltipsは、関数を呼び出すコードを書いている最中に、その関数のパラメータを表示してくれる。

source: Can I draw something with AHK?
ja: AHKで何か描けますか？

source: Can I find my script somewhere else?
ja: スクリプトはどこか他の場所にあるのでしょうか？

source: Can I run AHK from a USB drive?
ja: USBメモリからAHKを起動することはできますか？

source: Can I use wildcards or regular expressions in Hotstrings?
ja: Hotstringsでワイルドカードや正規表現を使用することはできますか？

source: Can also force the key to stay on or off.
ja: キーを強制的にON/OFFすることも可能。

source: Can be used to get or set the tray icon's tooltip text, which is displayed when the mouse hovers over it.
ja: トレイアイコンのツールチップテキストを取得または設定するために使用することができます。

source: Can be used to get or set the area to which coordinates are to be relative.
ja: 座標の相対的な領域を取得または設定するために使用できます。

source: Can be used to get or set the contents of the OS's clipboard.
ja: OSのクリップボードの内容を取得または設定するために使用できる。

source: Can be used to get or set the default encoding for various built-in functions.
ja: 様々な組み込み関数のデフォルト・エンコーディングを取得または設定するために使用できます。

source: Can be used to get or set the default mouse speed, an integer from 0 (fastest) to 100 (slowest).
ja: デフォルトのマウス速度を取得または設定するために使用します。0（最も速い）から 100（最も遅い）までの整数です。

source: Can be used to get or set the default title for MsgBox, InputBox, FileSelect, DirSelect and Gui.
ja: MsgBox、InputBox、FileSelect、DirSelect、Guiのデフォルトタイトルを取得または設定するために使用できます。

source: Can be used to get or set the delay for control-modifying functions, in milliseconds.
ja: 制御変更関数の遅延をミリ秒単位で取得または設定する。

source: Can be used to get or set the delay for windowing functions, in milliseconds.
ja: ウィンドウ関数の遅延をミリ秒単位で取得または設定する。

source: Can be used to get or set the delay or duration for keystrokes sent via SendPlay mode, in milliseconds.
ja: SendPlayモードで送信されるキー入力の遅延時間または持続時間をミリ秒単位で取得または設定するために使用できます。

source: Can be used to get or set the delay or duration for keystrokes, in milliseconds.
ja: キー入力の遅延時間または継続時間をミリ秒単位で取得または設定する。

source: Can be used to get or set the mouse delay, in milliseconds.
ja: マウスディレイをミリ秒単位で取得または設定する。

source: Can be used to get or set the number of the current loop iteration (a 64-bit integer).
ja: 現在のループの繰り返し回数（64ビット整数）を取得または設定するために使用できる。

source: Can be used to get or set the registry view.
ja: レジストリのビューを取得または設定する。

source: Can be used to get or set the script's current working directory, which is where files will be accessed by default.
ja: スクリプトのカレント作業ディレクトリを取得または設定するために使用する。

source: Can be used to get or set the send level, an integer from 0 to 100.
ja: 送信レベル（0～100の整数）を取得または設定する。

source: Can be used to get or set the send mode.
ja: 送信モードの取得または設定に使用できる。

source: Can be used to get or set the title match mode.
ja: タイトルマッチモードの取得または設定に使用できる。

source: Can be used to get or set the title match speed.
ja: タイトルマッチのスピードを取得または設定するために使用できる。

source: Can be used to get or set whether the script's main window is allowed to be opened via the tray icon.
ja: スクリプトのメインウィンドウを トレイアイコンから開くことを許可するかどうかを取得または設定するために使用できます。

source: Can be used to get or set whether to detect hidden text in a window.
ja: ウィンドウ内の隠しテキストを検出するかどうかを取得または設定するために使用できる。

source: Can be used to get or set whether to detect hidden windows.
ja: 隠しウィンドウを検出するかどうかを取得または設定する。

source: Can be used to get or set whether to hide the tray icon.
ja: トレイアイコンを隠すかどうかを取得または設定する。

source: Can be used to get or set whether to log lines.
ja: 行をログに記録するかどうかを取得または設定する。

source: Can be used to get or set whether to restore the state of CapsLock after a Send.
ja: Send後にCapsLockの状態を復元するかどうかを取得または設定するために使用できます。

source: Cancel the menu by left-clicking outside of it.
ja: メニューの外側を左クリックしてキャンセルする。

source: Cancel, Try Again, Continue
ja: キャンセル、再実行(T)、続行(C)

source: Cancels any previous -, otherwise has no effect.
ja: それ以外の場合は、何の効果もなく、以前の-をキャンセルします。

source: Canonicalizes component/directory separators, replacing / with \ and eliminating redundant separators.
ja: コンポーネント/ディレクトリのセパレータを正規化し、/を \に置き換え、冗長なセパレータを削除します。

source: Capital \B is the opposite:
ja: キャピタル\Bはその逆である：

source: Capital \B is the opposite: it requires that the current character not be at a word boundary.
ja: キャピタル\Bはその逆である：この場合、現在の文字が単語境界にないことが必要である。

source: CapsLock and IME
ja: CapsLockとIME

source: Capture a subpattern such as the dot-star in abc(.*)xyz.
ja: abc(.*)xyzのドットスターのようなサブパターンをキャプチャする。

source: Capture output:
ja: キャプチャー出力：

source: Captures audio through a microphone jack.
ja: マイク端子から音声を取り込む。

source: Captures whatever audio is being output to the Speakers endpoint.
ja: Speakersエンドポイントに出力されている音声をキャプチャする。

source: Care must be taken as this can allow the creation of paths that "normal" programs cannot access.
ja: これにより、「通常の」プログラムがアクセスできないパスが作成される可能性があるため、注意が必要である。

source: Care should be taken not to make the above too lenient because if you ever inadvertently introduce an infinite loop of keystrokes (via a Send function that accidentally triggers other hotkeys), your computer could become unresponsive due to the rapid flood of keyboard events.
ja: もし、不注意でキー入力の無限ループ（Send関数が他のホットキーを誤ってトリガーする）を導入した場合、キーボードイベントの急激な洪水によりコンピュータが応答しなくなる可能性があるため、上記が甘くならないように注意する必要があります。

source: Care should be taken not to make the setting too lenient because if you ever inadvertently introduce an infinite loop of keystrokes (via a Send function that accidentally triggers other hotkeys), your computer could become unresponsive due to the rapid flood of keyboard events.
ja: この設定が甘くならないように注意してください。そうでないと、不注意でキー入力の無限ループ（Send関数が他のホットキーを誤って起動する）に陥ってしまった場合、キー入力の連続でコンピュータが応答しなくなるでしょう。

source: CaretGetPos - Syntax & Usage | AutoHotkey v2
ja: CaretGetPos-構文と使用法｜AutoHotkey v2

source: Carriage return (`r) or linefeed (`n) may be used to create multiple lines of text.
ja: キャリッジリターン(`r)またはラインフィード(`n)を使って複数行のテキストを作成することができる。

source: Carry out, perform, evaluate, put into effect, etc. Execute basically has the same meaning as in non-programming speak.
ja: 実行する、実行する、評価する、実行に移す、など。Executeは、基本的にノンプログラミングの言葉と同じ意味です。

source: Case sensitive:
ja: 大文字小文字を区別します。

source: Case-conforming hotstrings (which are the default) produce their replacement text in all caps if you type the abbreviation in all caps.
ja: 大文字小文字を区別するホットストリング（デフォルト）は、略語を全角で入力すると、置換テキストを全角で生成します。

source: Case-insensitive matching, which treats the letters A through Z as identical to their lowercase counterparts.
ja: 大文字小文字を区別しないマッチングで、AからZまでを小文字と同じものとして扱う。

source: Case-insensitive sort based on the current user's locale.
ja: 現在のユーザーのロケールに基づき、大文字小文字を区別せずにソートします。

source: Case-insensitive sort.
ja: 大文字小文字を区別しないソート。

source: Case-sensitive sort (ignored if the N option is also present).
ja: 大文字小文字を区別してソートします（Nオプションがある場合は無視されます）。

source: Catch - Syntax & Usage | AutoHotkey v2
ja: Catch - 構文と使用法｜AutoHotkey v2

source: Causes KeyHistory to display the last 100 instead 40 keyboard and mouse events.
ja: KeyHistoryに、40個のキーボードとマウスイベントの代わりに、最後の100個のイベントを表示するようにします。

source: Causes a delay of 10 ms to occur after each windowing function.
ja: 各ウィンドウイング関数の後に10msのディレイを発生させます。

source: Causes a function to be called automatically and repeatedly at a specified time interval.
ja: 指定した時間間隔で、自動的に繰り返し関数を呼び出します。

source: Causes a selected item to remain selected when the tree-view control loses focus.
ja: ツリービューコントロールがフォーカスを失ったときに、選択された項目を選択されたままにする。

source: Causes a solitary carriage return (`r) to be the only recognized newline marker (see above).
ja: キャリッジリターン（`r）を唯一の改行マーカーとして認識させる（上記参照）。

source: Causes a solitary linefeed (`n) to be the only recognized newline marker (see above).
ja: 単独の改行（`n）を唯一の改行マーカーとして認識させる（上記参照）。

source: Causes some or all hotkeys to buffer rather than ignore keypresses when their #MaxThreadsPerHotkey limit has been reached.
ja: ホットキーの一部または全部が、#MaxThreadsPerHotkeyの制限に達した場合、キー入力を無視するのではなく、バッファリングするようになります。

source: Causes subsequently added controls to be belong to the specified tab of a Tab control.
ja: 追加されたコントロールは、タブコントロールの指定されたタブに所属するようにします。

source: Causes text to be displayed from right-to-left (RTL).
ja: テキストを右から左に表示する（RTL）。

source: Causes the OnKeyDown and OnKeyUp callbacks to be called each time the key is pressed.
ja: キーが押されるたびにOnKeyDownおよびOnKeyUpコールバックが呼び出されるようにします。

source: Causes the UpDown control to set the text of the buddy control (using the WM_SETTEXT message) when the position changes.
ja: 位置が変更されたときに、UpDownコントロールが（WM_SETTEXTメッセージを使用して）バディコントロールのテキストを設定する。

source: Causes the address of the parameter list (a single integer) to be passed to Function instead of the individual parameters.
ja: 個々のパラメータではなく、パラメータリストのアドレス（1つの整数）をFunctionに渡すようにします。

source: Causes the control to exhibit "hot tracking" behavior.
ja: コントロールを「ホットトラッキング」動作にする。

source: Causes the control to wrap around to the other end of its range when the user attempts to go beyond the minimum or maximum.
ja: ユーザーが最小値または最大値を超えようとしたときに、コントロールがその範囲のもう一方の端に回り込むようにする。

source: Causes the control's arrows to point left and right instead of up and down.
ja: コントロールの矢印を上下ではなく左右に向ける。

source: Causes the first hotkey *Numpad0:: to trigger the second hotkey ~LButton::.
ja: 最初のホットキー*Numpad0::が2番目のホットキー~LButton::をトリガーするようにします。

source: Causes the first two hotkeys to buffer rather than ignore keypresses when their #MaxThreadsPerHotkey limit has been reached.
ja: 最初の2つのホットキーが#MaxThreadsPerHotkeyの制限に達した場合、キー入力を無視するのではなく、バッファリングするようにします。

source: Causes the first two hotkeys to use the keyboard hook.
ja: 最初の2つのホットキーがキーボードフックを使用するようにします。

source: Causes the item being selected to expand and the item being unselected to collapse upon selection in the tree-view.
ja: ツリービューで項目を選択すると、選択中の項目は展開され、非選択中の項目は折りたたまれる。

source: Causes the launcher to exit immediately after launching the script, instead of waiting in the background for it to terminate.
ja: スクリプトの終了をバックグラウンドで待つのではなく、スクリプトを起動した直後にランチャーを終了させる。

source: Causes the launcher to identify which interpreter it would use and return it instead of running the script.
ja: ランチャーがスクリプトを実行する代わりに、使用するインタープリターを特定し、それを返すようにする。

source: Causes the list box to send a notification code to the parent window whenever the user clicks a list box item (LBN_SELCHANGE), double-clicks an item (LBN_DBLCLK), or cancels the selection (LBN_SELCANCEL).
ja: ユーザーがリストボックスの項目をクリックする（LBN_SELCHANGE）、項目をダブルクリックする（LBN_DBLCLK）、選択をキャンセルする（LBN_SELCANCEL）ときに、リストボックスから親ウィンドウに通知コードが送信されます。

source: Causes the mouse cursor to be moved instantly.
ja: マウスカーソルを瞬時に移動させることができるようになります。

source: Causes the script to behave as though the specified file's contents are present at this exact position.
ja: 指定されたファイルの内容がこの位置に存在するかのようにスクリプトを動作させます。

source: Causes the script to launch without a tray icon.
ja: トレイアイコンなしでスクリプトを起動するようにします。

source: Causes the script to run only on v2.0, including alpha releases.
ja: アルファ版を含むv2.0上でのみスクリプトを実行するようにするためのものです。

source: Causes the script to run only on v2.0, including pre-release versions.
ja: プレリリースバージョンを含むv2.0上でのみスクリプトを実行するようにします。

source: Causes the script to run only with a 64-bit interpreter (EXE) version 2.0-rc.2 or later.
ja: 64ビットインタプリタ（EXE）バージョン2.0-rc.2以降でのみスクリプトを実行するようにすることです。
